app/views/dashboard/index.html.erb

<ul>
  <% current_user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1