app/views/tasks/_form.erb

        <%= form.input :name %>
        <%= form.input :user, :collection => User.all.map{|u|[u.email, u.id]} %>
---
SELECT "users".* FROM "users"