app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "picto_content_type", "picto_file_name", "picto_file_size", "picto_updated_at", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @picture = Picture.new(params[:picture])
    if @picture.save