app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])
    @project.manager = current_user
    if @project.save
---
INSERT INTO "projects" ("active", "created_at", "manager_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["active", false], ["created_at", Mon, 25 Jun 2012 15:17:32 UTC +00:00], ["manager_id", 1], ["name", "Testing project"], ["updated_at", Mon, 25 Jun 2012 15:17:32 UTC +00:00]]

  def update
    if @project.update_attributes(params[:project])
---
UPDATE "projects" SET "active" = 't', "updated_at" = '2012-06-25 15:29:22.585694' WHERE "projects"."id" = 3