app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "description", "name", "priority", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(params[:task])
    @task.project = @project
    if @task.save

UPDATE "tasks" SET "priority" = 'Normal', "updated_at" = '2012-06-25 16:24:45.619846' WHERE "tasks"."id" = 4
---
  def update
    if @task.update_attributes(params[:task])